# IsFixedDistanceToHostFace Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..IsFixedDistanceToHostFace Method
RebarConstraint Class See Also
---
Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsFixedDistanceToHostFace()
```

Visual Basic
---
```text
Public Function IsFixedDistanceToHostFace As Boolean
```

Visual C++
---
```text
public:
bool IsFixedDistanceToHostFace()
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace